["Physical buttons outperform touchscreens in new cars, test finds","Why was Roman concrete so durable?","Show HN: I spent 2 years building Tablane as a 17-year-old","That paper with the ‘T’ error bars was just retracted","A Curious Integral","Artsy Engineering Handbook","How transportation technologies shaped empires","U.S. stock market returns – a history from the 1870s to 2022","Sunken Greenhouse","An Upper Palaeolithic Proto-Writing System and Phenological Calendar","Less gym time, same results: Why ‘lowering’ weights is all you need to do","Dwarf Fortress has sold half a million copies","Perfect Circle","Netscape\"s Constellation (1997)","How to Build an Exchange (2017)","Making the ultimate-guitar.com web player easier to practice with","A Brief Defense of XML","Human gene linked to bigger brains was born from seemingly useless DNA","Thousands of scientists publish a paper every five days (2018)","Canaries in coal mines (2018)","Why Cassettes?","The Frontier computer, which broke the exascale barrier in 2022","Cisco commences layoffs, slashing nearly 700 Bay Area tech jobs","MT-Propeller 11 blade propeller delivers 15% increase in static thrust","My bad habit of hoarding information","P Language: a state machine-based programming language (2021)","GitHub is sued, and we may learn something about Creative Commons licensing","Fourth membrane is discovered in the brain","A plea for culinary modernism (2001) [pdf]","Rust Atomics and Locks: Low-Level Concurrency in Practice","Lago (YC S21), open-source usage based billing, is hiring senior Ruby engineers","FBI Looking for Hashflare Victims","Changing firmware config that doesn\"t want to be changed","Politics and the English Language (1946)","Coaching engineering managers to take on organizational problems","Deaths by Vaccination Status, England","Tell HN: Oculus will delete purchases if you don’t switch to a meta account","Flying Disc Museum","Ask HN: Share your personal site","Matrix.org homeserver: Severely degraded performance due to database issues","The Tyranny of Nicespeak (2001)","Emergency measures needed to rescue Great Salt Lake from ongoing collapse","Why didn’t we get the four-hour workday?","ULID – Sortable Unique Identifier","Ask HN: ORM or Native SQL?","Ask HN: Server side rendering is now a good idea?","I scanned every Python package and found 57 live AWS keys","‘Consciousness’ in Robots Was Once Taboo. Not Anymore","Independent researcher claims to find writing in prehistoric cave paintings","Wikipedia admin jailed for 32 years after alleged Saudi infiltration","Gaining access to inherited AWS EC2 instances","Who Needs Haskell? Straight to Rust Hell","Rising rent, not poverty, is the real driver of homelessness","Richardson Maturity Model","In 2022, the IRS Went After the Poorest Taxpayers","You’re killing your PS5 by using it vertically, according to hardware experts","Carta announces layoffs, fires CTO","VALL-E: Neural codec language models are zero-shot text to speech synthesizers","The FTC Is Right: Noncompete Agreements Are a Scourge","Show HN: List of Stripe Alternatives","Roland’s 50th Anniversary Concept Piano","Zelda: Link\"s Awakening game engine documentation (2021)","Ask HN: Is there academic research on software fragility?","Ask HN: What sub $200 product improved your 2022","BMW I Vision Dee","Why are antennas popping up over the Salt Lake City foothills?","Ask HN: How to restore cognition after years of trauma? I feel slow and dumb","Debugging Lisp: trace options, break on conditions","Narco Subs 101 (2020)","Yark: Advanced and easy YouTube archiver now stable","No, you can’t manufacture that like Apple does (2014)","Go libraries you need to know","Swallow Calendar","Code Riffs","Polaroids from the set of cult cyber classic Hackers","‘Remember your training’: teen pilot makes emergency landing on Route 66","The skilled trades haven\"t caught as a career choice with Gen Z","Spammy syscalls in strace dumps","Amish People Stay Healthy in Old Age. Here\"s Their Secret","Switzerland: snow flown in by helicopter in attempt to keep ski slopes open","Ways you can use ChatGPT to write code","Ask HN: What\"s on your home server?","How Childhood Trauma Leads to Addiction – Gabor Maté","LiteSync – Easy synchronization of SQLite databases","Microsoft admits it should not have argued the FTC is unconstitutional","The intersection of shadow stacks and CRIU","Omg.lol – A lovable web page and email address","The Future of ZFS on Ubuntu Desktop Is Not Looking Good","Learn to Process Text in Linux Using Grep, Sed, and Awk","Show HN: Vim online editor using WebAssembly, storing files using IndexedDB","A practical comparison of build and test speed between C++ and Rust","Fun, danger, and 70s airplane toys","How to get 1.5 TFlops of FP32 performance on a single M1 CPU core","Show HN: GPTDuck – Ask questions about any GitHub repo","Apple Books digital narration","Carl Hewitt has died [pdf]","Why C-SPAN’s Camera Work Is Suddenly So Interesting","Show HN: ClickHouse-local – a small tool for serverless data analytics","Anna’s Update: fully open source archive, Elasticsearch, 300GB+ of book covers","The physics principle of diffusion inspired modern AI art","Why depend of Zoom, Teams, Google Meet if you can have Your own WebRTC solution","Papers and patents are becoming less disruptive over time","X servers no longer allow byte-swapped clients","Going full time on my SaaS after 13 years","Berkeley Lab scientists develop a new method of refrigeration","My Identity Is Worth $5.21","David Sacks: The tech reset has only just begun","How ChatGPT saves me hours of work every day","The YC Founder Directory","Please stop using Win32_product to find installed software","Babashka Babooka: Write Command-Line Clojure","Microsoft is preparing to add ChatGPT to Bing","Amazon S3 will now encrypt all new data with AES-256 by default","Salesforce layoffs hit SF\"s Slack, with 10% of staff reportedly getting cut","AMD Announces 7950X3D, 7900X3D Upto 128MB L3 Cache","First electronic games used calculator chips","Luigi Colani\"s typewriter stations (2021)","ESP32-P4: High-Performance MCU with Numerous IOs and Security Features","Reverse Engineering the DualShock 4","Razer’s $400 soundbar has a creepy camera to help emit surround sound","GoatCounter: Open-source hosted/self-hosted web analytics","How to Befriend Crows?","Please Sell My Personal Information","Cargo Cult Quantum Factoring","Caltech to launch space solar power technology demo into orbit","Writing a Tiny RISC-V Emulator [video]","Why Paul Ehrlich got everything wrong","How to Optimize a CUDA Matmul Kernel for CuBLAS-Like Performance: A Worklog","‘Breakthrough’ obesity drugs that have stunned researchers","Bankruptcy judge rules that Earn account assets belong to Celsius","International nuclear fusion project may be delayed by years, its head admits","A Skeptical Take on ChatGPT: Ezra Klein Interviews Gary Marcus","India tops Japan to become world\"s No. 3 auto market","Wizards of the Coast Trying to Retroactively Cancel OGL 1.0a","Goodbye TypeScript, hello native typing for JavaScript","I Migrated from a Postgres Cluster to Distributed SQLite with LiteFS","Database of 200k cell images yields new mathematical framework","Superposition, Memorization, and Double Descent","Chaos Hypertextbook","G-3PO: A protocol droid for Ghidra, or GPT-3 for reverse-engineering","Is it possible for a lunar eclipse to occur before sunset?","A History of Early Microcontrollers, Part 1","Transcoding Unicode with AVX-512: AMD Zen 4 vs. Intel Ice Lake","Mercedes-Benz will build a $1B EV fast-charging network in the US","Ask HN: Why are URNs not more popular?","U.S. moves to seize $460M Robinhood stake linked to Sam Bankman-Fried","How to Restore Our Dwindling Attention Spans","U.S. moves to bar noncompete agreements in labor contracts","Microfeatures I\"d like to see in more languages","Murder Most Foul: On Agatha Christie","Judge Says Celsius Crypto Investors Don\"t Own Their Accounts","Libcpucycles is a public-domain microlibrary for counting CPU cycles","Safer Linux Kernel Modules Using the D Programming Language","Ask HN: What expensive product was a complete waste of money?","California drought: Why doesn’t California build big reservoirs any more? (2014)","A beloved in every port: Iskandar\"s encounters with women","California forces companies to show pay on job listings, revealing salaries","Elevator Control Panels","Slack\"s private GitHub code repositories stolen over holidays","Mastering Emacs Weekend Book Club","Rijndael S-box in 512 bytes of Python","The literary life of Pessoa’s alter ego (2020)","Ask HN: Are ICs at tech companies usually so concerned about job performance?","Modules, not microservices","Why wet feels wet: Understanding the illusion of wetness","Tell HN: A stranger is using my YouTube account and Google can\"t log them out","Artificial Life Creation T-0 and Launching [video]","The oldest evidence for humans swimming is from 100k years ago","Twilio’s toll fraud problem","Tiny Prime Combinations","Engineers Want to Build Conscious Robots. Others Say It’s a Bad Idea","AMD’s Zen 4, Part 3: System Level Stuff, and iGPU","Open Source Alternative to Zoom, Teams, Google-Meet","Chinese tracking device ‘found in UK Government car’","In a world first, AI lawyer will help defend a real case in the US","The 10 year old indie mobile app: what worked for the long haul","Revue will shut down and all data will be deleted","The genetic history of Scandinavia from the Roman Iron Age to the present","Lnav – An advanced log file viewer for the small-scale","Aleister Crowley, the Wickedest Climber Ever? (2022)","Moonwalkers: Shoes that make you walk faster (pre-order)","Does the world have enough lithium to move to electric vehicles?","The Binance Scam Chain","Hacker Lexicon: What Is a Pig Butchering Scam?","Scientists have discovered the first virovore – an organism that eats viruses","Denoising Diffusion models from first principle in Julia","Thechikottukavu Ramachandran","Leaked Slack all-hands meeting reveals a ‘strong culture clash’ with Salesforce","Caloric restriction increases lifespan but affects brain integrity in lemurs","Perl Weekly","Fancy a quick tour of DragonFly BSD 6.4?","The (Almost) Definitive 486DX/50 Article","Could legalisation of cannabis transform Mexico’s economy?","French startup unveils new residential thermo-acoustic heat pump","Why SQLite succeeded as a database (2016)","Adobe Lightroom uses photos for AI training by default","Luck, Tesla design likely saved family that plunged off cliff, experts say","Infinite AI Array","Spreadsheet with compute-like functions: GET(), POST(), PARSE(), ASK_OpenAI()","Saudi Arabia jails two Wikipedia staff","Walter Cunningham, who helped pave the way to the moon, dies at 90","Personal Knowledge Management Is Rubbish","Language models and poetics (2020)","Photograph of ISS in conjunction with Tycho Crater as it transited the moon","Researchers develop a light source that produces two entangled light beams","C Posix-compliant argument parsing in 42 LoC, inspired by Duff\"s device","Profiting from the Folly of Others (2020)","Small Teams","OpenAI is in talks for tender offer that would value it at $29B","FTC cracks down on companies that impose harmful noncompete restrictions","Potentiometers – Modifying Taper","How do I draw a pair of buttocks? (2014)","Show HN: Semantic search for video","Having friends in HR is fine, but HR is not your friend","Caroline Ellison Plea Hearing Transcript (12/19/2022) [pdf]","NYC officials say they can\"t find EV garbage trucks powerful enough to plow snow","Lenovo’s Yoga Book 9i is an unprecedented laptop for people who hate foldables","Migrating our largest mobile app to React Native","The expanding dark forest and generative AI","How the physics of diffusion inspired modern AI art","Searching “Gary glitter” on Apple Maps shows all public restrooms","Pushup: a new compiler for making web apps in Go","Rust Atomics and Locks (book) is now freely available","Bitcoin’s Energy Usage Isn’t a Problem. Here’s Why","Sailboat UI – A Framework for Tailwind","Google wants RISC-V to be a “tier-1” Android architecture","Kids and music lessons: why do many promising players quit early?","Ask HN: Contingency plans for a lead dev no longer avail?","Samsung bets on MicroLED and 8K for its premium 2023 TVs","Peloton agrees to pay a $19M fine for delay in disclosing treadmill defec","Athenian Taxes","AutoHotKey V2 (Breaking Upgrade)","Show HN: Nanelo DNS – Privacy-Friendly, European Nameservers","The Filesystem Hierarchy Standard Comes to Guix Containers","Memristors Run AI Tasks at 1/800th Power","What Is AGI-Hard","An unorthodox scholar uses technology to expose Biblical forgeries","Ask HN: Best Talks of 2022","Excerpts from the User Guide for the SynaTech-3411 3D Bio-Printer","Some thoughts on Prometheus Alertmanager\"s alert reminders","RISC vs. CISC: The Post-RISC Era (1999)","Show HN: A device that only lets you type lol if you\"ve truly laughed out loud","Can self-replicating species flourish in the interior of a star? (2020) [pdf]","Emulating an emulator inside itself. Meet Blink","The history of deputy gangs in the Los Angeles County Sheriff\"s Department","Kuo: Apple No Longer Planning to Launch iPhone SE 4 Next Year","Svelte Diagramming Tool Svelvet 5.0 Launch","How do you know when macOS detects and remediates malware?","On-demand learning comes at the cost of conceptual understanding","Cancer Vaccine to Simultaneously Kill and Prevent Brain Cancer Developed","Treating documentation like a product","Show HN: AREnets – TensorFlow-based Relation Extraction kit for work in Colab","“MasquerAds” – Google’s Ad-Words Abused by Threat Actors","Juan Tamariz, the godfather of close-up card magic","Artist banned, told to “find a different style”- AI-made art","Show HN: Ello (YC W20) – AI-reading tutor for kids that works with real books","Performance of WebAssembly Runtimes in 2023","Why Google and Apple work to snuff out the mobile web","Ask HN: What\"s your home network setup?","Fault-Tolerant SFTP Scripting","AMD Claims New Laptop Chip Is 30% Faster Than M1 Pro, Up to 30 Hours on Battery","Perf Engineering with Python 3.12","Two surprises in browser crashes","YouTuber Logan Paul’s CryptoZoo NFT project is a total mess","Salesforce will lay off 10% of staff as part of restructuring","Ruby 3.2.0 is from another dimension","How to slow down scientific progress, according to Leo Szilard","Londoner solves 20k-year Ice Age drawings mystery","Ask HN: What should I do with dontbenebby.org, com, and net?","Meta Quest Pro – Bad AR Passthrough","U.S. Auto Sales in 2022 Worst in over a Decade","A Lisp Interpreter Implemented in Conway\"s Game of Life","Embed Neovim in Chrome, Firefox and Others","Crypto exchange Huobi to cut staff 20% in \"bear market\"","Faster MySQL with HTTP/3","Globalization is dead and no one is listening","All About USB-C: Resistors and Emarkers","South Korea’s online security dead end","Vaccine and prior SARS-CoV-2 infection confer long-lasting protection omi-BA.5","Fossjobs: A free job board for Free and Open Source jobs","Why is the JavaScript ecosystem like this?","Ask HN: What should I listen to on a 16 hr roadtrip","WAL Mode in LiteFS","English as She Is Spoke (1884) [pdf]","Ask HN: How many of you are open to Piracy again?","Migrating from AWS to Fly.io","The infrastructure behind ATMs","Newsraft: feed reader with ncurses user interface","The faker\"s guide to reading x86 assembly language","QBittorrent v4.5.0: The Hitchhiker\"s Guide to Legible Text","Slack is cutting 10% of its product and engineering org","Function keys productivity trick","Show HN: Ov – feature rich terminal pager","Get Started with Rust: Generics","SERV: 32-bit is the New 8-bit [video]","Google’s quest to digitize troops’ tissue samples","Web hackers vs. the auto industry","Microsoft workers to form company’s first union in the U.S.","Marshall McLuhan on surveillance and identity in the electric age (1977) [video]","Artist banned from subreddit because style looks like AI art","Amazon to Lay Off over 17,000 Workers, More Than First Planned","My Youtube earnings","Bill Gates: I\"m literally losing sleep over Java (1996)","Strontian to Laga Bay","The strangest computer manual ever written","Breaking RSA with a quantum computer?","Tobacco companies must pay for clean up of discarded cigarettes in Spain","Moiré no more (2021)","The FDA will likely approve the diabetes drug tirzepatide for weight loss","Cargo Cult Quantum Factoring","Show HN: An open source tool to generate Jet Engine compressors","Supermicro throws its weight behind Arm servers","We must dismantle the barriers that GDPR creates for global science","What does it look like for the web to lose?","Parallel streaming in Haskell: Part 1 – Fast, efficient, and fun","“Unexplainable” core dump (2011)","IRC: Run it or use it, but try to avoid doing both (2021)","Espressif Reveals ESP32-P4: High-Performance MCU with Connectivity and Security","MacBook owners have two months to claim up to $395 over butterfly keyboard woes","Japan’s business owners can’t find successors – one man is giving his away","The different sorts of \"iconification\" of windows in X","Kerbal Space Program free on Epic","Sim Wong Hoo has died","Lenovo\"s Smart Paper tablet is a $400 answer to the Kindle Scri","MSVC: The Devourer of Const","State Department Recognizes Türkiye as Turkey’s Formal Name","What HHS has to say about tracking technologies in latest HIPAA guidance","Tesla finally breaks and offers round steering wheel on Model S/X","Lincoln Cathedral","Names that decreased in popularity from 2020 to 2021","Rackspace says hackers accessed customer data during ransomware attack","Apple headset leak reveals new details and confirms earlier rumors","A Note on Distributed Computing (1994) [pdf]","The Strangely Beautiful Experience of Google Reviews","Salesforce Guts Tableau After Spending $15.7B in 2019 Deal","The Avogadro Constant And The Epoxy Putty (2018)","Ask HN: Alternatives to Scratch for a blind child?","Microsoft Bing AI Image Creator","Three-eyed forehead in Stable Diffusion","GNU Parallel Tutorial","DragonFly BSD 6.4","Georgia man is falsely arrested after facial recognition tech gets it wrong","ChatGPT banned from New York City public schools’ devices and networks","Podlite – Pod6 markup language editor","Databases in 2022: A Year in Review","CircleCI security alert: Rotate any secrets stored in CircleCI","Go 1.20 Cryptography","2022 JavaScript Rising Stars","France fines Apple for targeted App Store ads without consent","Gptzero: Efficient detection of AI generated text","ANT plus is PAN for ants","Thanks to DALL-E, the race to make artificial protein drugs is on","Google researcher, long out of math, cracks devilish problem about sets","Reviving proteins from billions of years ago to fight diseases in human cells","The ‘Dune Hypothesis’","Some Remarks on Large Language Models","Chunking strings in Elixir: how difficult can it be?","Legal use of hallucinogenic mushrooms begins in Oregon","NYC schools block ChatGPT, fearing negative impact on learning","Measuring an engineering organization","CircleCI Security Incident – “Rotate any secrets stored in CircleCI”","I\"ve started writing a Game Engine in Haskell","Investors conclude that Tesla is a carmaker, not a tech firm","Private and Public Mastodon","Ask HN: Have IRL tech meetups rebounded in your area?","Works entering the public domain this year","Inline AppleScript Documentation","Free Pascal PS4 Emulator (fpPS4) v0.0.1 Released","‘Endless Flight’ Review: The Vision and Anguish of Joseph Roth","Hnefatafl","Frederic Tudor in 1806 brings cocktails and ice cream to the rest of the world","Amazon secures $8B term loan","WordPress sites under attack from newly found Linux trojan","The cost of cheap TVs","Scalene: A Python memory profiler with AI-powered optimization proposals","Higher-order organization of multivariate time series","The Cargo Cult of TCP_nodelay: When to Use It","Whatever Happened to Google Search?","I still have an old-school cert on my HTTPS site","Stanford Distances Itself from Now-Viral ‘Harmful Language’ List","HTTP/3 prioritization demystified","Urllib3 in 2022","Underappreciated challenges with Python packaging","Ask HN: Pros and cons of thinking in public vs. in private?","Living with Wolves","JPSO used facial recognition technology to arrest a man. The tech was wrong","A toy implementation of Landin\"s ISWIM language. (2018)","A brief rant on converging compliance regimes","Ask HN: What are you working on this year?","Intelligence – A good collection of great OSINT Resources","BlackRock Halts Withdrawals from £3.5B UK Property Fund","Tell HN: I just received my Equifax breach settlement check","CLib: Header-only C library that implements the most important classes from GLib","Tesla FSD Beta 10.69.25 Struggles in Snowy Detroit MI: A Scary Video","Men Without Work (2016)","Wondering what to do (if anything) about hotlinking","Incoming potentially catastrophic storm for SF area","Finding people\"s use of /usr/bin/Python with the Linux audit framework","What do I need to buy to beat my iPhone 14 Pro?","Ask HN: What are your favorite podcasts about indie game design/development?","Sergey Brin: Irate Call from Steve Jobs","The Algol 68 Genie project","Bflat – a single ahead-of-time crosscompiler and runtime for C#","Are we on information overload? (2012)","Portal rendering with offscreen render targets (2015)","Even More Bay Area House Party","FTSE 100 bosses paid more in three days than average UK worker for whole year","Multi-camera real-time object detection with WebRTC and YOLO","GPTZero – an app to tell if an essay is written by ChatGPT","Students in Iran are risking everything to rise up against the government","Ask HN: Our app has been attacked – How do you handle?","U.S. trade deficit shrinks 21% to 26-month low as imports tumble","Shopify tells employees to just say no to meetings","Is the urge to start a company caused by a brain parasite?","Reading Better: Retaining and Applying What You Read","Show HN: Mergetin - browser puzzle game","Show HN: Barf – An Minimal Blog Generator","Ask HN: A Better Docker Compose?","Show HN: Beesy – Record Google Meets for free, download locally","x86 is Turing-complete with no registers (2014)","AT&T\"s predictions of the future (1993)","Microsoft\"s response to liberating the ending to Minecraft","The Slow Death of Surveillance Capitalism Has Begun","Ask HN: Where do you currently get weather forecasting in a browser?","Using Swift for Scripting (2019)","Zig now has a built in HTTP 1.1 client","Ask HN: Has a life coach ever worked for you?","Salesforce Guts Tableau After Spending $15.7B in 2019 Deal","26 programming languages in 25 days, Part 2: Reflections on language design","Walgreens executive says \"maybe we cried too much last year\" about theft","I didn’t like the price so I built a SaaS company over a weekend","Dream3D: Zero-Shot Text-to-3D Synthesis Using 3D and Text-to-Image Diffusion","U.S. Making the Same Mistakes with EVs It Made with Gas Cars","Why do commercial trucks have convex and concave wheels?","Show HN: Modest – An open-source micro-blog app to create a Twitter-like blog","Musicians wage war against evil robots (2012)","How the marijuana ‘green rush’ fell apart","RIP sf/f author Suzy McKee Charnas (1939-2023)","The MOS 6502 is (mostly) Turing-complete without registers","Pyright: Static Type Checker for Python","Show HN: Django CBV Inspect – A tool to help visualize Django class-based views","Writing a Python SQL engine from scratch","Djota: A Djot Implementation in Prolog","Meta prohibited from use of personal data for advertising","Non-binary DDR5 is finally coming","China’s reopening will disrupt the world economy","Brain cells keep growing well into our 70s","Favorite Compiler and Interpreter Resources","Ask HN: Complex dynamic websites on S3?","Lua will be 30 this year","My strategies for keeping my attention","Google accuses Indian antitrust watchdog of plagiarizing EU ruling","The concept of class invariant in object-oriented programming","PDP-11/Hack (2014)","Inside the 8086 processor\"s instruction prefetch circuitry","Ask HN: What\"s Your Experience of Fly.io?","Solving a Dungeons and Dragons riddle using Prolog","Python 2 removed from Debian","Stitch Fix plans 20% job cuts as CEO steps down","FTC proposes to ban noncompete clauses. Move will help workers, entrepreneurs","HTTPie AI","10x C++ Editor","Global Spyware Scandal: Exposing Pegasus","Nintendo GBA and DS ROM hacking guide (2016)","Grokking RISC-V Vector Processing","Show HN: Sit.","Who is Alex Mashinsky, the man behind the alleged Celsius crypto fraud?","Why I still have an old-school cert on my HTTPS site","On the Gnome project and “my way or the highway”","Tell HN: GitHub is partially blocked in India","Bach to the Future – Humanising Music with Neural Nets (2019)","The Diary of Samuel Pepys","Show HN: Create beautiful videos from screenshots or pdf in seconds","Ask HN: Has anyone tried throwing GPT3 at unobfuscating / disassembly?","First LNG tanker arrives at Germany\"s new floating terminal","In 2022, Web3 went just great","Samsung Profit Tumbles in Historic Drop on Chip Price Falls","Crypto Lender Genesis Lays Off 30% of Staff in Second Round of Layoffs","Ask HN: Does dieting impact your productivity?","Non-Destructive Silicon Imaging","I tried Paragon\"s ntfs3 and it didn\"t go well","To build truly intelligent machines, teach them cause and effect (2018)","LearnCPP: Website devoted to teaching you how to program in C++","Stitch Fix lays off 20% of staff, CEO steps down","Ask HN: Best way to share client code in 2023","IEDM 2022 – TSMC 3nm","Tallow in plastics – why? (2016)","Tesla driver intentionally drove car off a cliff with family; everyone survived","Adobe is training AI on private content stored in Creative Cloud","Brokenism - The real debate today isn\"t between the left and right","Ask HN: As a startup, what are your must-have sections for a landing page?","Update: Stripe is holding over $400k of mine with no explanation [resolved]","Solar panels reduced my electric bill in 2022","Lisp on browser","Meta prohibited from using personal data for advertisement","BusyBox 1.36.0","Muse: Text-to-Image Generation via Masked Generative Transformers","Japanese government offers families 1M yen a child to leave Tokyo","Show HN: Laravel-Magellan – A modern PostGIS library published","Soapbox, a Web UI for the Fediverse, releases version 3.0"]
